app/controllers/chores_controller.rb

  def index
    @chores = Chore.chronological.by_task.to_a
---
SELECT "tasks".* FROM "tasks" ORDER BY name

  def create
    @chore = Chore.new(chore_params)

    respond_to do |format|
      if @chore.save
---
INSERT INTO "chores" ("child_id", "task_id", "due_on", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @chore.update(chore_params)
---
UPDATE "chores" SET "completed" = ?, "updated_at" = ? WHERE "chores"."id" = 138

  def destroy
    @chore.destroy
---
DELETE FROM "chores" WHERE "chores"."id" = ?

    def set_chore
      @chore = Chore.find(params[:id])
---
SELECT  "chores".* FROM "chores"  WHERE "chores"."id" = ? LIMIT 1