app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"   ORDER BY name
---
  def index
    @tasks = Task.alphabetical.to_a

INSERT INTO "tasks" ("created_at", "name", "points", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 15 Sep 2017 18:46:40 EDT -04:00], ["name", "Test"], ["points", 9], ["updated_at", Fri, 15 Sep 2017 18:46:40 EDT -04:00]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save