app/views/chores/_vue_form.html.erb

    <%= f.label :task_id %><br />
    <%= f.collection_select :task_id, Task.alphabetical.active.all, :id, :name, {:prompt => "Select task..."}, "v-model.number" => "task_id" %>
---
SELECT "tasks".* FROM "tasks"  WHERE "tasks"."active" = 't'  ORDER BY name